In [23]:
#https://www.babycenter.com.au/popular-baby-names
from bs4 import BeautifulSoup
import re
import pandas as pd

--- Amelia+2 Isla+4 Charlotte-1 Ava-3 Olivia-1 Mia-1 Lily+2 Willow+2 Sophia-1 Zoe+1 Evie+4 Ivy+2 Harper-6 Ella+6 Ruby+3 Isabella-4 Layla+0 Isabelle+14 Matilda+0 Chloe+4 Sophie+4 Aria+0 Zara-7 Grace-11 Sienna+4 Evelyn-5 Mila+1 Lucy-5 Emily-3 Frankie+14 Scarlett-1 Riley+19 Abigail+4 Mackenzie+12 Charlie-4 Maddison-3 Georgia-10 Audrey-4 Hazel+0 Madeline+7 Poppy+4 Lyla-6 Aaliyah-5 Hannah-9 Ayla-4 Eva+3 Emma-4 Violet-8 Eleanor+13 Hayley+15
--- Elsie+16 Alice+3 Ariana+24 Florence-12 Aurora+5 Ellie-6 Penelope+6 Millie+15 Piper+2 Daisy+10 Luna+10 Marley-9 Maya+9 Indie-10 Freya-13 Kiara+32 Sadienew! Macie+0 Skylar-5 Annabelle+18 Eliza+12 Hallienew! Stella+24 Savannah-18 Billie-27 Aubrey+4 Claire+9 Summer+11 Harriet-5Reminew! Imogen+1 Jasmine-3 Olive+17 Lola-18 Mikayla+14 Noranew! Bonnie+3 Edennew! Laranew!Everlynew! Lexi-6 Maggienew! Maia-12 Thea-37 Eloise-20 Alexis-38 Addison-10 Harlow-22 Indiana-30 Paige-4

In [123]:
def get_names(txt,gender):
    
    
    z=txt.split()
    arr=[]
    for i in z:
        word=(re.split('\+|-',i))[0]
        arr.append(word)
    df=pd.DataFrame(arr)
    df.columns=['Name']
    df['Gender']=gender
    return df

def parse_url(url,gender):
    page = requests.get(url)
    soup = BeautifulSoup(page.content, 'html.parser')

    txt=soup.find_all(['ol'])[0].get_text()
    return get_names(txt,gender)

def all_babies(url1,url2):
    girls=parse_url(url1,'F')
    boys=parse_url(url2,'M')

    all_df=pd.concat([boys,girls])
    all_df['nysiis']=all_df.Name.apply(lambda x:fuzzy.nysiis(x))
    return all_df
df1=all_babies('https://www.babycenter.com.au/2019-top-baby-girl-names','https://www.babycenter.com.au/2019-top-baby-boy-names')
df1.head()

     Name Gender  nysiis
0  Oliver      M  OLAVAR
1    Noah      M       N
2     Leo      M       L
3   Lucas      M     LAC
4    Jack      M     JAC

In [130]:
df1.nysiis.value_counts()

L         2
LAC       2
GARG      2
CARLY     2
ISABAL    2
         ..
CARTAR    1
ALY       1
EVALAN    1
AV        1
ETAN      1
Name: nysiis, Length: 93, dtype: int64

In [132]:
df1.loc[df1.nysiis=='L']

     Name Gender nysiis
2     Leo      M      L
41  Louis      M      L